In [1]:
import pandas as pd 
import csv
import cx_Oracle

In [2]:
f = pd.read_csv('data-files/all_salaries.csv')
f = f.iloc[:, 1:]
f = f.replace(',', '', regex=True)

for row in f.values[:3]:
    print(row)

['이강철' 1997 '해태' '11000']
['김정수' 1997 '해태' '9600']
['홍현우' 1997 '해태' '9600']

In [3]:
conn = cx_Oracle.connect('team', 'one', '127.0.0.1:1521/xe')
cursor = conn.cursor()

sql1 = """
        create table salaries (player varchar2(10 char), 
                               play_year number, 
                               player_team varchar2(10 char), 
                               salary number)
      
        """

cursor.execute(sql1)

sql2 = """
        insert into salaries  values(:player, :play_year, :player_team, :salary)
      """

for row in f.values:
    
    cursor.execute(sql2, row)
    
conn.commit()
cursor.close()
conn.close()

In [4]:
pl = pd.read_csv('data-files/player_data_50000.csv', sep=',')

pl. rename(columns={pl.columns[0]: 'ID'}, inplace=True)

pl.rename(columns={'선수명: ':'player', '등번호: ':'back_number',  '생년월일: ':'birth_date', '포지션: ':'position', '신장/체중: ':'height/weight', '경력: ':'career', '입단 계약금: ':'down_payment', '연봉: ':'salary', '지명순위: ':'draft order', '입단년도: ':'first year'}, inplace=True)

pl.isnull().sum(axis=0)
pl.fillna('0', inplace=True)

In [5]:
conn = cx_Oracle.connect('team', 'one', '127.0.0.1:1521/xe')
cursor = conn.cursor()
sql3 = """
        create table playerslist (identification varchar2(20 char) ,
                                  player varchar2(10 char),
                                  back_number varchar2(6 char) ,
                                  birth_date varchar2(20 char),
                                  positions varchar2(20 char),
                                  heightweight varchar2(15 char) ,
                                  career varchar2(100 char),
                                  down_payment varchar2(10 char),
                                  salary varchar2(10 char) ,
                                  draft varchar2(100 char) ,
                                  first_year varchar2(20 char)
                                  )
      
        """

cursor.execute(sql3)

In [6]:
sql4 = """
        insert into playerslist values(:identification, :player, :back_number, :birth_date, :positions, :heightweight, :career, :down_payment, :salary, :draft, :first_year)
      """

for row in pl.values:
    cursor.execute(sql4, row)

conn.commit()
cursor.close()
conn.close()

In [7]:
pl2 = pd.read_csv('data-files/player_data_60000.csv', sep=',')

pl2. rename(columns={pl2.columns[0]: 'identification'}, inplace=True)

pl2.rename(columns={'선수명: ':'player', '등번호: ':'back_number',  '생년월일: ':'birth_date', '포지션: ':'position', '신장/체중: ':'height/weight', '경력: ':'career', '입단 계약금: ':'down_payment', '연봉: ':'salary', '지명순위: ':'draft order', '입단년도: ':'first year'}, inplace=True)

pl2.isnull().sum(axis=0)
pl2.fillna('0', inplace=True)

In [8]:
conn = cx_Oracle.connect('team', 'one', '127.0.0.1:1521/xe')
cursor = conn.cursor()

sql5 = """
        insert into playerslist values(:identification, :player, :back_number, :birth_date, :positions, :heightweight, :career, :down_payment, :salary, :draft, :first_year)
      """

for row in pl2.values:
    cursor.execute(sql5, row)

conn.commit()
cursor.close()
conn.close()

In [9]:
pl3 = pd.read_csv('data-files/player_data_70000_100000.csv', sep=',')

pl3. rename(columns={pl3.columns[0]: 'identification'}, inplace=True)

pl3.rename(columns={'선수명: ':'player', '등번호: ':'back_number',  '생년월일: ':'birth_date', '포지션: ':'position', '신장/체중: ':'height/weight', '경력: ':'career', '입단 계약금: ':'down_payment', '연봉: ':'salary', '지명순위: ':'draft order', '입단년도: ':'first year'}, inplace=True)

pl3.isnull().sum(axis=0)
pl3.fillna('0', inplace=True)

In [10]:
conn = cx_Oracle.connect('team', 'one', '127.0.0.1:1521/xe')
cursor = conn.cursor()

sql6 = """
        insert into playerslist values(:identification, :player, :back_number, :birth_date, :positions, :heightweight, :career, :down_payment, :salary, :draft, :first_year)
      """

for row in pl3.values:
    cursor.execute(sql6, row)

conn.commit()
cursor.close()
conn.close()